using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Presentation
{
    public class Info
    {
        public static string Text = @"Благородный олень или настоящий олень — парнокопытное млекопитающее из семейства оленевых.
Благородный олень объединяет в себе много подвидов, представители которых отличаются друг от друга размерами, весом, окраской и некоторыми другими признаками. Кавказский олень, европейский олень, марал, крымский олень, бухарский или тугайный олень, вапити, изюбрь — все они являются подвидами этого животного. Это можно легко определить по таким параметрам, как шерсть животного, которая в летний период не имеет пятнистого окраса, а белое пятно под хвостом большое и поднимается выше начала хвоста. Благородный олень имеет рога с большим количеством отростков (как правило, их не менее пяти), которые образуют своеобразную узнаваемую крону на вершине рога. Всего подвидов благородного оленя насчитывается более 15.

Подвиды благородного оленя имеют различные размеры. Например, достаточно крупные марал и вапити весят более 300кг и достигают длины тела более 2,5м при высоте в холке 130-160 см, а небольшой бухарский олень весит менее 100кг и имеет длину тела 175-190см. Могут отличаться подвиды и формой рогов. Например, европейский олень имеет большое количество отростков, а маралы не имеют кроны, зато сам рог очень массивен и даёт 6-7 отростков.

Благородный олень обитает во многих районах мира. Ареал достаточно велик. Это животное можно встретить по всей территории Западной Европы, в Белоруссии, Алжире и Марокко, в Южной Скандинавии, Афганистане, Монголии, Тибете, в Юго-Восточном Китае. Наиболее обширный участок ареала — в Северной Америке. Завезён в Австралию и Новую Зеландию, Аргентину и Чили. Там благородный олень акклиматизировался и отлично себя чувствует. 

Питается благородный олень самой разнообразной пищей. Основной едой этого животного является травянистая растительность, злаки, бобовые. Весной, после сложного для животных времени года — зимы, особое значение придаётся употреблению в пищу белковой растительности, для пополнения сил и получения полноценного витаминного корма. В зимний период времени, если снежный покров не очень велик, благородный олень пользуется возможностью добывать упавшие осенью листья с деревьев, различные стебли и кору кустарников. Употребляют также хвою сосны и ели. Большим подспорьем в зимний период времени для оленей являются жёлуди, которые животное добывает из-под снега. Также в пищу идут каштаны, всевозможные орехи, семена многих видов растений. Грибы, лишайники, плоды, ягоды — всё идет в пищу благородному оленю. Питание может меняться в зависимости от того, какой урожай был в предшествующий зиме год. В пищу благородные олени употребляют соль, добывая её на солонцах. Лижут соль, грызут землю, которая полна минеральными солями, пополняют недостаток минералов в организме, пользуясь минеральными источниками. В жару не пасутся, а лежат в тени, лишь утром и вечером выходя на пастбища. От зноя спасаются в реках, где могут проводить большее количество времени суток. Бухарский олень выходит на пастбище ночью. Зимой, когда температура воздуха опускается достаточно низко, животные вынуждены питаться практически весь день, чтобы пополнить запас энергии.";
    }
}
